Repository: alizici/Subtitle-find-terms
Catalog: lib/l10n/app_*.arb
Languages: tr, zh

# appTitle
source: Chinese-English Term Corrector
tr: Çince-İngilizce Terim Düzeltici
zh: 中英术语校正器

# projectsScreenTitle
source: Projects
tr: Projeler
zh: 项目

source: New Project
tr: Yeni Proje
zh: 新项目

source: Delete Project
tr: Projeyi Sil
zh: 删除项目

source: Edit Project
tr: Projeyi Düzenle
zh: 编辑项目

source: Project Name
tr: Proje Adı
zh: 项目名称

source: Save
tr: Kaydet
zh: 保存

source: Cancel
tr: İptal
zh: 取消

# deleteConfirmation
source: Are you sure you want to delete this project? This action cannot be undone.
tr: Bu projeyi silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.
zh: 您确定要删除此项目吗？此操作无法撤消。

source: Yes
tr: Evet
zh: 是

source: No
tr: Hayır
zh: 否

# saveDialogTitle
source: Save
tr: Kaydet
zh: 保存

# categoryPerson
source: Person
tr: Kişi
zh: 人物

# categoryPlace
source: Place
tr: Yer
zh: 地点

# categoryOrganization
source: Organization
tr: Organizasyon
zh: 组织

# categoryTechnical
source: Technical
tr: Teknik
zh: 技术

# categoryOther
source: Other
tr: Diğer
zh: 其他

# categoryGeneral
source: General
tr: Genel
zh: 一般

# defaultTermsFileName
source: terms.json
tr: terimler.json
zh: 术语.json

# defaultReportFileName
source: term_report.html
tr: terim_raporu.html
zh: 术语报告.html

# errorFileLoad
source: An error occurred while loading the file
tr: Dosya yüklenirken bir hata oluştu
zh: 加载文件时出错

# errorFileSave
source: An error occurred while saving the file
tr: Dosya kaydedilirken bir hata oluştu
zh: 保存文件时出错

# errorTermImport
source: An error occurred while importing terms
tr: Terimler içe aktarılırken bir hata oluştu
zh: 导入术语时出错

# errorTermExport
source: An error occurred while exporting terms
tr: Terimler dışa aktarılırken bir hata oluştu
zh: 导出术语时出错

# successTermImport
source: Terms successfully imported
tr: Terimler başarıyla içe aktarıldı
zh: 术语成功导入

# successTermExport
source: Terms successfully exported
tr: Terimler başarıyla dışa aktarıldı
zh: 术语成功导出

# successFileLoad
source: File successfully loaded
tr: Dosya başarıyla yüklendi
zh: 文件加载成功

# successFileSave
source: File successfully saved
tr: Dosya başarıyla kaydedildi
zh: 文件保存成功

# successCorrectionsApplied
source: Corrections successfully applied
tr: Düzeltmeler başarıyla uygulandı
zh: 成功应用更正

# invalidTimeFormat
source: Invalid time format: {timestamp}
tr: Geçersiz zaman formatı: {timestamp}
zh: 时间格式无效: {timestamp}

# invalidSecondsFormat
source: Invalid seconds/centiseconds format: {timestamp}
tr: Geçersiz saniye/salise formatı: {timestamp}
zh: 秒/厘秒格式无效: {timestamp}

# timestampParsingError
source: Timestamp parsing error: '{timestamp}' - {error}
tr: Zaman damgası ayrıştırma hatası: '{timestamp}' - {error}
zh: 时间戳解析错误: '{timestamp}' - {error}

# warningDialogueMissingFields
source: Warning: Not enough fields in Dialogue line: {line}
tr: Uyarı: Dialogue satırında yeterli alan bulunamadı: {line}
zh: 警告: 对话行中的字段不足: {line}

# dialogueParsingError
source: Could not parse Dialogue line: '{line}' Format: {format} Error: {error}
tr: Dialogue satırı ayrıştırılamadı: '{line}' Format: {format} Hata: {error}
zh: 无法解析对话行: '{line}' 格式: {format} 错误: {error}

# editButton
source: Edit
tr: Düzenle
zh: 编辑

# deleteButton
source: Delete
tr: Sil
zh: 删除

source: Source Text
tr: Kaynak Metin
zh: 源文本

source: English Translation
tr: İngilizce Çeviri
zh: 英文翻译

source: Corrected
tr: Düzeltildi
zh: 已修正

# applyButton
source: Apply
tr: Uygula
zh: 应用

# appliedStatus
source: Applied
tr: Uygulandı
zh: 已应用

# linePrefix
source: Line
tr: Satır
zh: 行

# incorrectLabel
source: Incorrect:
tr: Hatalı:
zh: 错误:

# correctLabel
source: Correct:
tr: Doğru:
zh: 正确:

source: Term Management
tr: Terim Yönetimi
zh: 术语管理

source: Import
tr: İçe Aktar
zh: 导入

source: Export
tr: Dışa Aktar
zh: 导出

source: Search Term
tr: Terim Ara
zh: 搜索术语

source: Filter Category
tr: Kategori Filtrele
zh: 过滤类别

source: All
tr: Tümü
zh: 全部

source: Person Name
tr: Kişi İsmi
zh: 人名

source: Place Name
tr: Yer İsmi
zh: 地名

source: Organization
tr: Organizasyon
zh: 组织

source: Technical Term
tr: Teknik Terim
zh: 技术术语

source: General
tr: Genel
zh: 通用

source: Other
tr: Diğer
zh: 其他

source: No terms found
tr: Hiçbir terim bulunamadı
zh: 未找到术语

source: Edit Term
tr: Terimi Düzenle
zh: 编辑术语

source: Add New Term
tr: Yeni Terim Ekle
zh: 添加新术语

source: Chinese Term
tr: Çince Terim
zh: 中文术语

# enterChineseTerm
source: Please enter Chinese term
tr: Lütfen Çince terimi girin
zh: 请输入中文术语

source: English Term
tr: İngilizce Terim
zh: 英文术语

# enterEnglishTerm
source: Please enter English term
tr: Lütfen İngilizce terimi girin
zh: 请输入英文术语

source: Category
tr: Kategori
zh: 类别

source: Notes
tr: Notlar
zh: 笔记

source: Add
tr: Ekle
zh: 添加

source: Update
tr: Güncelle
zh: 更新

source: Delete Term
tr: Terimi Sil
zh: 删除术语

# confirmDelete
source: Are you sure you want to delete this term?
tr: Bu terimi silmek istediğinizden emin misiniz?
zh: 您确定要删除此术语吗？

source: Delete
tr: Sil
zh: 删除

# importSuccess
source: Project imported successfully
tr: Proje başarıyla içe aktarıldı
zh: 项目导入成功

# error
source: Error: {error}
tr: Hata: {error}
zh: 错误: {error}

# errorWithMessage
source: Error: {message}
tr: Hata: {message}
zh: 错误：{message}

source: Import Result
tr: İçe Aktarma Sonucu
zh: 导入结果

source: OK
tr: Tamam
zh: 确定

source: Export Terms
tr: Terimleri Dışa Aktar
zh: 导出术语

# exportSuccess
source: Project exported successfully
tr: Proje başarıyla dışa aktarıldı
zh: 项目导出成功

source: Reports
tr: Raporlar
zh: 报告

source: Export Report
tr: Rapor Dışa Aktar
zh: 导出报告

# pleaseUploadDocument
source: Please upload a document
tr: Lütfen bir belge yükleyin
zh: 请上传文档

source: Summary
tr: Özet
zh: 摘要

source: Total Lines
tr: Toplam Satır
zh: 总行数

source: Corrected Lines
tr: Düzeltilen Satır
zh: 已更正行数

source: Total Corrections
tr: Toplam Düzeltme
zh: 总更正数

source: Applied Corrections
tr: Uygulanan Düzeltme
zh: 已应用更正

source: Consistency Score
tr: Tutarlılık Puanı
zh: 一致性评分

source: Excellent consistency
tr: Mükemmel tutarlılık
zh: 优秀的一致性

source: Good consistency
tr: İyi tutarlılık
zh: 良好的一致性

source: Medium consistency
tr: Orta tutarlılık
zh: 中等一致性

source: Low consistency
tr: Düşük tutarlılık
zh: 低一致性

source: Very low consistency
tr: Çok düşük tutarlılık
zh: 非常低的一致性

source: Most Frequently Mistranslated Terms
tr: En Sık Yanlış Çevrilen Terimler
zh: 最常被错误翻译的术语

source: No mistranslated terms found
tr: Yanlış çevrilen terim bulunamadı
zh: 未找到错误翻译的术语

# timesOccurred
source: {count} times
tr: {count} kez
zh: {count} 次

source: Correction Details
tr: Düzeltme Detayları
zh: 更正详情

# totalCorrections2
source: Total: {count} corrections
tr: Toplam: {count} düzeltme
zh: 总计: {count} 项更正

# noCorrectionSuggestions
source: No correction suggestions yet
tr: Henüz düzeltme önerisi yok
zh: 暂无更正建议

# line
source: Line: {number}
tr: Satır: {number}
zh: 行: {number}

source: Save Report
tr: Raporu Kaydet
zh: 保存报告

# consistencyReportFileName
source: term_consistency_report.html
tr: terim_tutarlilik_raporu.html
zh: 术语一致性报告.html

source: Report saved successfully
tr: Rapor başarıyla kaydedildi
zh: 报告已成功保存

# importProjectTooltip
source: Import Project
tr: Projeyi İçe Aktar
zh: 导入项目

# noProjectsMessage
source: You haven't created any projects yet
tr: Henüz bir proje oluşturmadınız
zh: 您尚未创建任何项目

# totalProjects
source: Total {count} projects
tr: Toplam {count} proje
zh: 共 {count} 个项目

source: Description (Optional)
tr: Açıklama (İsteğe Bağlı)
zh: 描述（可选）

# descriptionHint
source: E.g.: Standardization of subtitle terms for 5-season Wuxia series
tr: Örn: 5 sezonluk Wuxia serisi altyazı termlerinin standardizasyonu
zh: 例如：5季武侠系列字幕术语的标准化

# projectNameHint
source: E.g.: Wuxia Series Term Translation
tr: Örn: Wuxia Serisi Terim Çevirisi
zh: 例如：武侠系列术语翻译

source: Project deleted
tr: Proje silindi
zh: 项目已删除

# exportProjectDialogTitle
source: Export Project
tr: Projeyi Dışa Aktar
zh: 导出项目

# projectDetails
source: Documents: {docCount} | Last update: {updateDate}
tr: Belgeler: {docCount} | Son güncelleme: {updateDate}
zh: 文档：{docCount} | 最后更新：{updateDate}

# exportAction
source: Export
tr: Dışa Aktar
zh: 导出

# deleteAction
source: Delete
tr: Sil
zh: 删除

source: Document Processing
tr: Belge İşleme
zh: 文档处理

# documentProcessingTitle
source: Document Processing
tr: Belge İşleme
zh: 文档处理

# horizontalPanelTooltip
source: Horizontal Panel View
tr: Yatay Panel Görünümü
zh: 水平面板视图

# verticalPanelTooltip
source: Vertical Panel View
tr: Dikey Panel Görünümü
zh: 垂直面板视图

# changeViewTooltip
source: Change View
tr: Görünümü Değiştir
zh: 更改视图

# openDocumentTooltip
source: Open Document
tr: Belge Aç
zh: 打开文档

# saveDocumentTooltip
source: Save Document
tr: Belgeyi Kaydet
zh: 保存文档

# resetPanelSizeTooltip
source: Reset Panel Size
tr: Panel Boyutunu Sıfırla
zh: 重置面板大小

source: Corrections ({count})
tr: Düzeltmeler ({count})
zh: 校正 ({count})

# applyAllCorrections
source: Apply All
tr: Tümünü Uygula
zh: 应用所有

# applyCorrections
source: Apply
tr: Uygula
zh: 应用

# clearCorrections
source: Clear
tr: Temizle
zh: 清除

source: Total
tr: Toplam
zh: 总计

source: Applied
tr: Uygulandı
zh: 已应用

source: Pending
tr: Bekliyor
zh: 待处理

# noCorrectionsYet
source: No correction suggestions yet
tr: Henüz düzeltme önerisi yok
zh: 暂无校正建议

# clickButtonForCorrections
source: Click the button in the bottom right corner to see correction suggestions
tr: Düzeltme önerilerini görmek için sağ alt köşedeki düğmeye tıklayın
zh: 点击右下角按钮查看校正建议

source: Filter by line:
tr: Satıra göre filtrele:
zh: 按行筛选：

source: All lines
tr: Tüm satırlar
zh: 所有行

source: Line {number}
tr: Satır {number}
zh: 行 {number}

source: Apply Correction
tr: Düzeltmeyi Uygula
zh: 应用校正

source: Current Line Text:
tr: Satırın Mevcut Metni:
zh: 当前行文本：

# enterCorrectedText
source: Enter corrected text here
tr: Düzeltilmiş metni buraya yazın
zh: 在此输入校正文本

# correctionForLine
source: Correction for line {number}
tr: Satır {number} için düzeltme
zh: 行 {number} 的校正

source: Term Database Reference:
tr: Terim Veritabanı Referansı:
zh: 术语数据库参考：

source: Term Searched in Database:
tr: Veritabanında Aranan Terim:
zh: 在数据库中搜索的术语：

source: Suggested Term:
tr: Önerilen Terim:
zh: 建议术语：

# dataDiscrepancyWarning
source: Warning: You can make your own correction.
tr: Uyarı: Veriler arasında uyumsuzluk olabilir. Terim veritabanındaki bilgiler satırın mevcut içeriğiyle uyuşmayabilir! Kendi düzeltmenizi yapabilirsiniz.
zh: 警告：数据之间可能存在差异。术语数据库中的信息可能与行的当前内容不匹配！您可以进行自己的校正。

source: Save Changes
tr: Değişiklikleri Kaydet
zh: 保存更改

source: Select Chinese Source Document
tr: Çince Kaynak Belgeyi Seçin
zh: 选择中文源文档

source: Select English Translation Document
tr: İngilizce Çeviri Belgesini Seçin
zh: 选择英文翻译文档

source: Select Folder to Save
tr: Kaydetmek İçin Klasör Seçin
zh: 选择保存文件夹

source: Document saved successfully
tr: Belge başarıyla kaydedildi
zh: 文档保存成功

# emptyTermDatabase
source: Term database is empty. Please add terms first.
tr: Terim veritabanı boş. Lütfen önce terim ekleyin.
zh: 术语数据库为空。请先添加术语。

source: Processing document
tr: Belge işleniyor
zh: 正在处理文档

# noCorrectionsFound
source: No correction suggestions found. All terms are used correctly or there are no matching terms.
tr: Hiçbir düzeltme önerisi bulunamadı. Tüm terimler doğru kullanılmış veya eşleşen terim yok.
zh: 未找到校正建议。所有术语使用正确或没有匹配的术语。

# correctionsFound
source: {count} correction suggestions found.
tr: {count} düzeltme önerisi bulundu.
zh: 找到 {count} 个校正建议。

# errorProcessingDocument
source: Error processing document: {error}
tr: Belge işlenirken hata oluştu: {error}
zh: 处理文档时出错：{error}

# correctionTextEmpty
source: Correction text cannot be empty!
tr: Düzeltme metni boş olamaz!
zh: 校正文本不能为空！

source: Correction applied successfully
tr: Düzeltme başarıyla uygulandı
zh: 校正应用成功

# errorApplyingCorrection
source: Error applying correction: {error}
tr: Düzeltme uygulanırken hata oluştu: {error}
zh: 应用校正时出错：{error}

source: No corrections to apply
tr: Uygulanacak düzeltme bulunamadı
zh: 没有可应用的校正

source: All corrections applied
tr: Tüm düzeltmeler uygulandı
zh: 所有校正已应用

source: Project Terms
tr: Proje Terimleri
zh: 项目术语

source: New Term
tr: Yeni Terim
zh: 新术语

# noTermsInProject
source: No terms in this project yet
tr: Bu projede henüz terim yok
zh: 此项目中还没有术语

source: Add Term
tr: Terim Ekle
zh: 添加术语

# optionalNotes
source: Notes (Optional)
tr: Notlar (İsteğe Bağlı)
zh: 备注（可选）

# termsRequired
source: Chinese and English terms are required
tr: Çince ve İngilizce terimler gereklidir
zh: 中文和英文术语是必填的

source: Term added
tr: Terim eklendi
zh: 术语已添加

source: Term updated
tr: Terim güncellendi
zh: 术语已更新

# deleteTermConfirmation
source: Are you sure you want to delete this term?
tr: Bu terimi silmek istediğinizden emin misiniz?
zh: 您确定要删除此术语吗？

source: Term deleted
tr: Terim silindi
zh: 术语已删除

source: Add Document
tr: Belge Ekle
zh: 添加文档

source: Add from Folder
tr: Klasörden Ekle
zh: 从文件夹添加

source: Project not found
tr: Proje bulunamadı
zh: 找不到项目

# noDocumentsInProject
source: No documents in this project yet
tr: Bu projede henüz belge yok
zh: 此项目中还没有文档

source: Last Update
tr: Son Güncelleme
zh: 最后更新

# addDocumentsForReports
source: Add documents first to generate reports
tr: Raporlar oluşturmak için önce belgeler eklemelisiniz
zh: 请先添加文档才能生成报告

source: Document added successfully
tr: Belge başarıyla eklendi
zh: 文档添加成功

# selectSubtitleFolder
source: Select Folder Containing Subtitle Files
tr: Altyazı Dosyalarını İçeren Klasörü Seçin
zh: 选择包含字幕文件的文件夹

# filesAdded
source: {count} file pairs added
tr: {count} dosya çifti eklendi
zh: 已添加{count}对文件

# errorsOccurred
source: {count} errors occurred
tr: {count} hata oluştu
zh: 发生了{count}个错误

# noMatchingSubtitlePairs
source: No matching subtitle pairs found
tr: Eşleşen altyazı çifti bulunamadı
zh: 找不到匹配的字幕对

# deleteDocumentConfirmation
source: Are you sure you want to delete this document from the project?
tr: Bu belgeyi projeden silmek istediğinizden emin misiniz?
zh: 您确定要从项目中删除此文档吗？

source: Document deleted
tr: Belge silindi
zh: 文档已删除

source: Delete Document
tr: Belgeyi Sil
zh: 删除文档

# documentLineInfo
source: Lines: {lineCount} | {correctionInfo}
tr: Satır sayısı: {lineCount} | {correctionInfo}
zh: 行数: {lineCount} | {correctionInfo}

# documentCorrectionInfo
source: Corrections in {count} lines
tr: {count} satırda düzeltme
zh: {count} 行有校正

# documentDateInfo
source: Added: {importDate} {processedInfo}
tr: Eklenme: {importDate} {processedInfo}
zh: 添加时间: {importDate} {processedInfo}

# documentLastProcessedInfo
source: | Last processed: {date}
tr: | Son işlem: {date}
zh: | 最后处理: {date}

# consistencyReportTitle
source: Term Consistency Report
tr: Terim Tutarlılık Raporu
zh: 术语一致性报告

source: Document
tr: Belge
zh: 文档

source: Creation Date
tr: Oluşturulma Tarihi
zh: 创建日期

# totalLinesReport
source: Total number of lines
tr: Toplam satır sayısı
zh: 总行数

# correctedLinesReport
source: Number of corrected lines
tr: Düzeltilen satır sayısı
zh: 已更正行数

# totalCorrectionsReport
source: Total number of corrections
tr: Toplam düzeltme sayısı
zh: 总更正数

# appliedCorrectionsReport
source: Number of applied corrections
tr: Uygulanan düzeltme sayısı
zh: 已应用更正数

# termLabel
source: Term
tr: Terim
zh: 术语

# frequencyLabel
source: Frequency
tr: Sıklık
zh: 频率

# statusLabel
source: Status
tr: Durum
zh: 状态

# pendingStatus
source: Pending
tr: Beklemede
zh: 待处理

source: Incorrect English Term
tr: Yanlış İngilizce Terim
zh: 错误英文术语

source: Correct English Term
tr: Doğru İngilizce Terim
zh: 正确英文术语

# lineNumber1
source: Line Number
tr: Satır No
zh: 行号

source: including duplicates
tr: tekrarlar dahil
zh: 包括重复项

source: Unique corrections
tr: Benzersiz düzeltmeler
zh: 唯一校正

source: Line not found
tr: Satır bulunamadı
zh: 未找到行

source: Processing line
tr: Satır işleniyor
zh: 正在处理行

source: term matches found
tr: terim eşleşmesi bulundu
zh: 找到术语匹配

source: WARNING
tr: UYARI
zh: 警告

source: Mismatched line numbers
tr: Eşleşmeyen satır numaraları
zh: 行号不匹配

source: Correcting
tr: Düzeltiliyor
zh: 正在修正

source: Correction
tr: Düzeltme
zh: 校正

source: should be
tr: olması gereken
zh: 应该是

source: Incorrect term not found
tr: Hatalı terim bulunamadı
zh: 未找到不正确的术语

source: in line
tr: satırında
zh: 在行

source: corrections applied
tr: düzeltme uygulandı
zh: 应用了校正

source: correct
tr: doğru
zh: 正确
